### 데이터 프레임
- 2차원 배열
- 2차원 벡터, 행렬
- 열 == 속성 == 항목
- 행 == 레코드 == 줄
- 예) 주식 종목: 행 - 관측값 / 열 - 종목코드, 회사이름, 액면가, 총주식수

In [1]:
# 데이터 프레임 만들기
import pandas as pd
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df=pd.DataFrame( dict_data, index = [ 'A', 'B', 'C' ] ) # 1.만들고
# 딕셔너리의 columns 이름은 못 바꾼다...? --> 만들고 난 후에 변경은 가능하다.
df.columns = ['초1','초2','초3','초4','초5'] # 2.이름 바꾸기
print(df)

   초1  초2  초3  초4  초5
A   1   4   7  10  13
B   2   5   8  11  14
C   3   6   9  12  15

In [2]:
dict_data1 = { 'name':['kim','Lee','Park'], 'age':[24,27,34], 'children':[2,1,3] }
df1 = pd.DataFrame(dict_data1)
print(df1)

   name  age  children
0   kim   24         2
1   Lee   27         1
2  Park   34         3

In [3]:
dict_food_data = { 'food':['KFC','McDonald','SchoolFood'], 'price':[1000,2000,2500], 'rating':[4.5,3.9,4.2] }
dfd = pd.DataFrame(dict_food_data)
print(dfd)

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [4]:
# 방법2) pd.DataFrame( 2차원배열, index=행인덱스배열, columns=열이름배열 )
d_2 = [ [15,'남','덕영중'], [17,'여','수리중'] ] #2차원
df2 = pd.DataFrame( d_2 )
df2.index = [ '1반','2반' ]
df2.columns = [ '나이','성별','중학교명' ]
print( df2 )
# 반의 이름은?
print( df2.index )
# 한 학생의 자료 항목은 무엇입니까?
print( df2.columns )
# rename
# 1반을 준서로, 2반을 예은으로 변경
df2 = df2.rename( index = {'1반':'준서', '2반':'예은'} )
print(df2)
# 중학교명을 학교라고 변경
df2 = df2.rename( columns = {'중학교명':'학교'} )
print(df2)

# df2 = df2.rename( index = {'1반':'준서', '2반':'예은'}, columns = {'중학교명':'학교'} ) -> 한 번에도 가능

# drop 삭제하기
# 문제) '예은'을 지우세요.
df2_drop = df2.drop('예은', axis="index")
print(df2_drop)
# 문제) '나이'를 지우세요.
df2_age_drop = df2.drop('나이', axis =1)
print(df2_age_drop)

    나이 성별 중학교명
1반  15  남  덕영중
2반  17  여  수리중
Index(['1반', '2반'], dtype='object')
Index(['나이', '성별', '중학교명'], dtype='object')
    나이 성별 중학교명
준서  15  남  덕영중
예은  17  여  수리중
    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
    나이 성별   학교
준서  15  남  덕영중
   성별   학교
준서  남  덕영중
예은  여  수리중

In [5]:
# 교재 <예제 1-7> p.22
exam_data = {
    '수학':[90,80,70],
    '영어':[98,89,95],
    '음악':[85,95,100],
    '체육':[100,90,90]
}
df = pd.DataFrame( exam_data, index = ['준서','우현','인아'] )
print(df)

df2=df.copy()
df2 = df2.drop('우현')
print(df2)

df3 = df.copy()
df3 = df3.drop( ['준서','인아'] )
print(df3)

df4 = df.copy()
# df4 = df4.drop( ['준서':'우현'] ) -> 오류 발생
print(df4)

df5 = df.copy()
df5 = df5.drop( '영어', axis=1 )
print(df5)

    수학  영어   음악   체육
준서  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
    수학  영어   음악   체육
준서  90  98   85  100
인아  70  95  100   90
    수학  영어  음악  체육
우현  80  89  95  90
    수학  영어   음악   체육
준서  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90
    수학   음악   체육
준서  90   85  100
우현  80   95   90
인아  70  100   90

In [6]:
exam_data = {
    '수학':[90,80,70],
    '영어':[98,89,95],
    '음악':[85,95,100],
    '체육':[100,90,90]
}
df = pd.DataFrame( exam_data, index = ['준서','우현','인아'] )
print(df)

label1 = df.loc['준서']
label1

    수학  영어   음악   체육
준서  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

수학     90
영어     98
음악     85
체육    100
Name: 준서, dtype: int64

In [7]:
# 5.데이터 프레임 문제 > 2번) food 컬럼과 rating 컬럼만 선택하여 출력하세요
dict_food_data = { 'food':['KFC','McDonald','SchoolFood'], 'price':[1000,2000,2500], 'rating':[4.5,3.9,4.2] }
dfd = pd.DataFrame(dict_food_data)
print(dfd)
print()
#food 컬럼만 선택
dfd_f = dfd.food
print(dfd_f)
print('\n')
print(type(dfd_f))
print()
#rating 컬럼만 선텍
dfd_r = dfd.rating
print(dfd_r)
print('\n')
print(type(dfd_r))
print()

#food와 price 동시에 선택
dfd_fp = dfd[['food', 'price']]
print(dfd_fp)
print('\n')
print(type(dfd_fp))

#

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

0           KFC
1      McDonald
2    SchoolFood
Name: food, dtype: object


<class 'pandas.core.series.Series'>

0    4.5
1    3.9
2    4.2
Name: rating, dtype: float64


<class 'pandas.core.series.Series'>

         food  price
0         KFC   1000
1    McDonald   2000
2  SchoolFood   2500


<class 'pandas.core.frame.DataFrame'>

In [8]:
# 예제 1-10
exam_data = {
    "이름":['서준','우현','인아'],
    "수학":[90,80,70],
    "영어":[98,89,95],
    "음악":[85,95,100],
    "체육":[100,90,90]
}
exam_df = pd.DataFrame(exam_data)
exam_df

# 1-10: 열 선택

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [9]:
# 1-10: 열 선택
exam_data = {
    "이름":['서준','우현','인아'],
    "수학":[90,80,70],
    "영어":[98,89,95],
    "음악":[85,95,100],
    "체육":[100,90,90]
}
exam_df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
exam_df

    이름  수학  영어   음악   체육
서준  서준  90  98   85  100
우현  우현  80  89   95   90
인아  인아  70  95  100   90

In [10]:
# 예제 1-10
exam_data = {
    "이름":['서준','우현','인아'],
    "수학":[90,80,70],
    "영어":[98,89,95],
    "음악":[85,95,100],
    "체육":[100,90,90]
}
exam_df = pd.DataFrame(exam_data)

print(type(exam_df))
print(exam_df)
print()

# 1-10: 열 선택
math1 = exam_df['수학']
print(math1)
print(type(math1))
print()

#영어
eng = exam_df.영어
print(eng)
print(type(eng))

# 다중 선택
# 수학, 음악
math_music = exam_df[['수학','음악']]
print(math_music)

# 범위 선택
exam_df[::]

<class 'pandas.core.frame.DataFrame'>
   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

0    90
1    80
2    70
Name: 수학, dtype: int64
<class 'pandas.core.series.Series'>

0    98
1    89
2    95
Name: 영어, dtype: int64
<class 'pandas.core.series.Series'>
   수학   음악
0  90   85
1  80   95
2  70  100

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [16]:
# 예제 1-11
exam_data = {
    "이름":['서준','우현','인아'],
    "수학":[90,80,70],
    "영어":[98,89,95],
    "음악":[85,95,100],
    "체육":[100,90,90]
}
exam_df = pd.DataFrame(exam_data)
exam_df = exam_df.set_index('이름')
print(exam_df.loc['서준',['음악','체육']])

음악     85
체육    100
Name: 서준, dtype: int64

In [17]:
# 추가
# 열추가
exam_df['국어'] = 80
exam_df
exam_df['컴퓨터'] = [100,85,75]
exam_df

    수학  영어   음악   체육  국어  컴퓨터
이름
서준  90  98   85  100  80  100
우현  80  89   95   90  80   85
인아  70  95  100   90  80   75

In [18]:
# 행추가 - 왜 안 되는지 모르겠음!!!
exam_df.loc['길동'] = [100,80,90,75,60,90]
exam_df

     수학  영어   음악   체육  국어  컴퓨터
이름
서준   90  98   85  100  80  100
우현   80  89   95   90  80   85
인아   70  95  100   90  80   75
길동  100  80   90   75  60   90

In [19]:
# <그림 1-14> 보고 코드해보기 p.41
exam_data = {
    "이름":['서준','우현','인아'],
    "수학":[90,80,70],
    "영어":[98,89,95],
    "음악":[85,95,100],
    "체육":[100,90,90]
}
exam_df = pd.DataFrame(exam_data)
print(exam_df)
print('*'*60)

# exam_df_3 = exam_df.loc[3] = 0 # 차이가 뭐지...
# print(exam_df_3)
exam_df.loc[3] = 0
print(exam_df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
************************************************************
   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0